SleepLSTM(
  (lstm): LSTM(10, 128, batch_first=True, dropout=0.5)
  (hidden1): Linear(in_features=128, out_features=16, bias=True)
  (fc): Linear(in_features=16, out_features=1, bias=True)
  (activation): ELU(alpha=1.0)
  (sigmoid): Sigmoid()
  (loss): BCELoss()
  (auc): BinaryAUROC()
  (cm): BinaryConfusionMatrix()
  (f1_score): BinaryF1Score()
)